Repository: sahilmishra03/vakeel-dairy
Catalog: lib/l10n/app_*.arb
Languages: hi

# appTitle
source: Vakeel Diary
hi: वकील डायरी

source: Advocate Portal
hi: वकील पोर्टल

source: Home
hi: होम

source: Cases
hi: केस

source: Settings
hi: सेटिंग्स

# reportsAndData
source: Reports & Data
hi: रिपोर्ट और डेटा

# exportTodayCases
source: Export Today's Cases
hi: आज के केस एक्सपोर्ट करें

# exportTodayCasesSubtitle
source: Generate PDF of today's hearings
hi: आज की सुनवाई का PDF बनाएं

source: Export All Cases
hi: सभी केस एक्सपोर्ट करें

# exportAllCasesSubtitle
source: Generate complete case database PDF
hi: पूर्ण केस डेटाबेस PDF बनाएं

source: App Preferences
hi: ऐप प्राथमिकताएं

source: Dark Mode
hi: डार्क मोड

source: Language
hi: भाषा

source: English
hi: अंग्रेजी

source: Hindi
hi: हिंदी

source: Generating PDF...
hi: PDF बनाया जा रहा है...

source: Export Failed
hi: एक्सपोर्ट विफल

source: No Data
hi: कोई डेटा नहीं

# noTodayCases
source: No cases scheduled for today
hi: आज के लिए कोई केस निर्धारित नहीं है

# noCasesFound
source: No cases found in the database
hi: डेटाबेस में कोई केस नहीं मिला

source: OK
hi: ठीक

# todayCasesReport
source: Today's Cases Report
hi: आज के केस रिपोर्ट

source: All Cases Report
hi: सभी केस रिपोर्ट

# totalCases
source: Total Cases: {count}
hi: कुल केस: {count}

# generated
source: Generated: {timestamp}
hi: बनाया गया: {timestamp}

# caseNumber
source: Case No.
hi: केस नं.

source: Client
hi: क्लाइंट

source: Court
hi: अदालत

source: Next Hearing
hi: अगली सुनवाई

source: Status
hi: स्थिति

source: Active
hi: सक्रिय

source: Closed
hi: बंद

# vakeelDiaryFooter
source: Vakeel Diary - Legal Case Management System
hi: वकील डायरी - लीगल केस मैनेजमेंट सिस्टम

source: Add Case
hi: केस जोड़ें

source: Today's Hearings
hi: आज की सुनवाई

source: Active Cases
hi: सक्रिय केस

source: View All
hi: सभी देखें

# noHearingsToday
source: No hearings scheduled for today
hi: आज के लिए कोई सुनवाई निर्धारित नहीं है

source: scheduled today
hi: आज निर्धारित

source: Case Details
hi: केस विवरण

source: Edit Case
hi: केस संपादित करें

source: Delete Case
hi: केस हटाएं

# deleteCaseTitle
source: Delete Case?
hi: केस हटाएं?

# deleteCaseMessage
source: This action cannot be undone.
hi: यह क्रिया पूर्ववत नहीं की जा सकती।

# caseNumberHint
source: Enter case number
hi: केस नंबर दर्ज करें

# clientNameHint
source: Enter client name
hi: क्लाइंट का नाम दर्ज करें

# courtNameHint
source: Enter court name
hi: अदालत का नाम दर्ज करें

# nextHearingHint
source: Select next hearing date
hi: अगली सुनवाई की तारीख चुनें

# caseStatusHint
source: Select case status
hi: केस की स्थिति चुनें

source: Save
hi: सेव करें

source: Cancel
hi: रद्द करें

source: Delete
hi: हटाएं

# confirmDelete
source: Are you sure you want to delete this case?
hi: क्या आप वाकई इस केस को हटाना चाहते हैं?

source: All Cases
hi: सभी केस

source: Search cases...
hi: केस खोजें...

source: Civil
hi: सिविल

source: Criminal
hi: आपराधिक

source: Family
hi: पारिवारिक

source: Corporate
hi: कॉर्पोरेट

source: Appellate
hi: अपीलीय

source: Parties
hi: पक्षकार

source: Client Name
hi: पक्षकार का नाम

source: Opponent Name
hi: विपक्षी का नाम

source: Judge Name
hi: न्यायाधीश का नाम

source: Timeline
hi: समयरेखा

source: Previous Hearing
hi: पिछली सुनवाई

source: Case Status
hi: केस की स्थिति

source: Case Type
hi: केस का प्रकार

source: Full Name
hi: पूरा नाम

source: Opponent party name
hi: विपक्षी पक्ष का नाम

source: Honorable Judge
hi: माननीय न्यायाधीश

source: Select Date
hi: तारीख चुनें

source: Coming Soon
hi: जल्द आ रहा है
